-- users テーブルのダミーデータ

INSERT INTO avatar_list (avatar_url)
 VALUES
('s128_f_event_98_0bg.png'),
('s128_f_event_98_1bg.png'),
('s128_f_event_98_2bg.png'),
('s128_f_object_108_0bg.png'),
('s128_f_object_108_1bg.png'),
('s128_f_object_108_2bg.png'),
('s128_f_object_135_0bg.png'),
('s128_f_object_135_1bg.png'),
('s128_f_object_135_2bg.png'),
('s128_f_object_13_0bg.png'),
('s128_f_object_13_1bg.png'),
('s128_f_object_13_2bg.png'),
('s128_f_object_149_0bg.png'),
('s128_f_object_149_1bg.png'),
('s128_f_object_152_0bg.png'),
('s128_f_object_152_1bg.png'),
('s128_f_object_152_2bg.png'),
('s128_f_object_153_0bg.png'),
('s128_f_object_153_1bg.png'),
('s128_f_object_153_2bg.png'),
('s128_f_object_155_0bg.png'),
('s128_f_object_158_0bg.png'),
('s128_f_object_158_1bg.png'),
('s128_f_object_158_2bg.png'),
('s128_f_object_163_0bg.png'),
('s128_f_object_163_1bg.png'),
('s128_f_object_163_2bg.png'),
('s128_f_object_174_0bg.png'),
('s128_f_object_174_1bg.png'),
('s128_f_object_174_2bg.png'),
('s128_f_object_21_0bg.png'),
('s128_f_object_21_1bg.png'),
('s128_f_object_21_2bg.png'),
('s128_f_object_25_0bg.png'),
('s128_f_object_25_1bg.png'),
('s128_f_object_25_2bg.png'),
('s128_f_object_49_0bg.png'),
('s128_f_object_49_1bg.png'),
('s128_f_object_49_2bg.png'),
('s128_f_object_52_0bg.png'),
('s128_f_object_52_1bg.png'),
('s128_f_object_52_2bg.png'),
('s128_f_object_60_0bg.png'),
('s128_f_object_88_0bg.png'),
('s128_f_object_88_1bg.png'),
('s128_f_object_88_2bg.png'),
('s128_f_object_8_0bg.png'),
('s128_f_object_8_1bg.png'),
('s128_f_object_8_2bg.png'),
('s128_f_object_94_0bg.png'),
('s128_f_object_94_1bg.png'),
('s128_f_object_94_2bg.png'),
('s128_f_traffic_11_0bg.png'),
('s128_f_traffic_2_0bg.png'),
('s128_f_traffic_2_1bg.png'),
('s128_f_traffic_2_2bg.png'),
('s128_f_traffic_3_0bg.png'),
('s128_f_traffic_3_1bg.png'),
('s128_f_traffic_3_2bg.png'),
('s128_f_traffic_6_0bg.png'),
('s128_f_traffic_6_1bg.png'),
('s128_f_traffic_6_2bg.png');



INSERT INTO users (username, sub,  allowed_name_changes ,life,avatar_id, profile ,trip,  penalty_points,karma, spam_activity_score, ng_user_list)
VALUES
    ('user_zero', 'c01dd252-82bf-4c05-92ee-74ea89c89b10', 3,10,'1','致し方なくPythonを書いています。よろしくおねがいします。','trip123',0, 50, 3, '["spam", "baduser"]'),
    ('user2', '71251b8b-f2e3-4261-a8a9-67f04265c5e6', 10, 3, '2', '暑くて寝れるかな','trip456',0, 75, 1, NULL),
    ('user3', 'c4561c8e-6fdd-4e93-b073-51c310358203', 10, 3, '3',  'エペ募集','trip789',0, 90, 5, '["block", "report"]'),
    ('user4', 'sub4', 10, 3, '4',  '旅行好きなひと〜','tripabc',0, 30, 8, NULL),
    ('user5', 'sub5', 10, 3, '5',  '使いこなせないけどコスメ買い漁りたい','tripxyz',0, 20, 2, '["spam", "annoying"]'),
    ('user6', 'sub6', 10, 3, '6',  '頭痛い。。。','trip123',0, 10, 4, NULL),
    ('user7', 'sub7', 10, 3, '7',  'ねむねむ','trip456',0, 65, 6, '["block", "inappropriate"]'),
    ('user8', 'sub8', 10, 3, '8',  '(*´ω`*)','trip789',0, 40, 7, NULL),
    ('user9', 'sub9', 10, 3, '9',  '仕事でやらかした。ついてないな','tripabc',0, 55, 9, '["spam", "rude"]'),
    ('user10', 'sub10', 10, 3, '10', '正しい希望は正しい絶望から','tripxyz',0, 70, 0, '["block", "annoying"]');


-- user_sessions テーブルのダミーデータ
INSERT INTO user_sessions (session_id, user_id, access_token, refresh_token, expiration_date)
VALUES
    ('session_id1', 1, 'access_token1', 'refresh_token1', '2023-12-31 23:59:59'),
    ('session_id2', 2, 'access_token2', 'refresh_token2', '2023-12-31 23:59:59'),
    ('session_id3', 3, 'access_token3', 'refresh_token3', '2023-12-31 23:59:59'),
    ('session_id4', 4, 'access_token4', 'refresh_token4', '2023-12-31 23:59:59'),
    ('session_id5', 5, 'access_token5', 'refresh_token5', '2023-12-31 23:59:59'),
    ('session_id6', 6, 'access_token6', 'refresh_token6', '2023-12-31 23:59:59'),
    ('session_id7', 7, 'access_token7', 'refresh_token7', '2023-12-31 23:59:59'),
    ('session_id8', 8, 'access_token8', 'refresh_token8', '2023-12-31 23:59:59'),
    ('session_id9', 9, 'access_token9', 'refresh_token9', '2023-12-31 23:59:59'),
    ('session_id10', 10, 'access_token10', 'refresh_token10', '2023-12-31 23:59:59');

-- rooms テーブルのダミーデータ

INSERT INTO rooms (name, label,owner_id,max_capacity  ,over_karma_limit, under_karma_limit,lux, status, last_activity)
VALUES
    ('🐟超ふつうなお部屋','🌽' ,1,20, 0,0,0, 'active', '2023-08-21 12:00:00'),
    ('お盆休み','( ˘ω˘)ｽﾔｧ' ,2,20, 0,0,0 , 'active', '2023-08-21 13:00:00'),
    ('たのしいお部屋','さわやか', 3,20, 0,0,0 , 'active', '2023-08-21 14:00:00'),
    ('Room 4','🐟超ふつうなお部屋', 4,20, 0,0,0 , 'active', '2023-08-21 15:00:00'),
    ('Room 5','🐟超ふつうなお部屋', 5,20, 0,0,0 , 'inactive', '2023-08-21 16:00:00'),
    ('Room 6','🐟超ふつうなお部屋', 6,20, 0,0,0 , 'active', '2023-08-21 17:00:00'),
    ('Room 7','🐟超ふつうなお部屋', 7,20, 0,0,0 , 'inactive', '2023-08-21 18:00:00'),
    ('Room 8','🐟超ふつうなお部屋', 8,20, 0,0,0 , 'active', '2023-08-21 19:00:00'),
    ('Room 9','🐟超ふつうなお部屋' ,9,20, 0,0,0 , 'inactive', '2023-08-21 20:00:00'),
    ('Room 10','🐟超ふつうなお部屋' ,10,20, 0,0,0, 'active', '2023-08-21 21:00:00');
-- room_members テーブルのダミーデータ
INSERT INTO room_members (room_id, user_id, joined_at)
VALUES
    (1, 1, '2023-08-21 12:00:00'),
    (1, 2, '2023-08-21 13:00:00'),
    (1, 3, '2023-08-21 14:00:00'),
    (2, 4, '2023-08-21 15:00:00'),
    (2, 5, '2023-08-21 16:00:00'),
    (3, 6, '2023-08-21 17:00:00'),
    (3, 7, '2023-08-21 18:00:00'),
    (4, 8, '2023-08-21 19:00:00'),
    (5, 9, '2023-08-21 20:00:00'),
    (5, 10, '2023-08-21 21:00:00');

-- messages テーブルのダミーデータ（50件）
INSERT INTO messages (room_id, sender_id, content, toxicity, sent_at)
VALUES
    (1, 1, 'こんにちは！', 0,'2023-08-21 12:00:00'),
    (1, 2, '今日の天気はいいですね。', 0,'2023-08-21 12:00:00'),
    (1, 3, 'こんにちは！', 0,'2023-08-21 12:00:00'),
    (2, 4, 'どうしたんですか？', 0,'2023-08-21 12:00:00'),
    (2, 5, '元気ですか？', 0,'2023-08-21 12:00:00'),
    (2, 1, 'こんばんは！', 0,'2023-08-21 12:00:00'),
    (3, 2, '新しい映画が公開されましたね。', 0,'2023-08-21 12:00:00'),
    (3, 3, '行ってみたいです。', 0,'2023-08-21 12:00:00'),
    (3, 4, '楽しみですね！', 0,'2023-08-21 12:00:00'),
    (4, 5, '今日は何をして過ごしましたか？', 0,'2023-08-21 12:00:00'),
    (4, 1, '私は友達とカフェに行ってきました。', 0,'2023-08-21 12:00:00'),
    (5, 2, 'おはようございます！', 0,'2023-08-21 12:00:00'),
    (5, 3, 'おはよう！', 0,'2023-08-21 12:00:00'),
    (5, 4, '朝ごはんは何を食べましたか？', 0,'2023-08-21 12:00:00'),
    (6, 5, 'こんにちは！', 0,'2023-08-21 12:00:00'),
    (6, 1, '仕事が忙しいです。', 0,'2023-08-21 12:00:00'),
    (7, 2, '今週末の予定はありますか？', 0,'2023-08-21 12:00:00'),
    (7, 3, '友達と遊びに行く予定です。', 0,'2023-08-21 12:00:00'),
    (8, 4, 'おめでとう！', 0,'2023-08-21 12:00:00'),
    (8, 5, 'どうしたの？', 0,'2023-08-21 12:00:00'),
    (9, 1, '楽しかったですか？', 0,'2023-08-21 12:00:00'),
    (9, 2, 'はい、楽しかったです！', 0,'2023-08-21 12:00:00'),
    (10, 3, '天気がいいので外に出たいです。', 0,'2023-08-21 12:00:00'),
    (10, 4, '私もそう思います。', 0,'2023-08-21 12:00:00');


-- blocked_users テーブルのダミーデータ
INSERT INTO blocked_users (blocking_user_id, blocked_user_id)
VALUES
    (1, 2),
    (2, 1),
    (3, 4),
    (4, 3),
    (5, 6),
    (6, 5),
    (7, 8),
    (8, 7),
    (9, 10),
    (10, 9);

INSERT INTO images (room_id, sender_id, image_url, timestamp)
VALUES
    (1, 1, 'image1.jpg', '2023-08-21 12:00:00'),
    (1, 2, 'image2.jpg', '2023-08-21 13:00:00'),
    (2, 3, 'image3.jpg', '2023-08-21 14:00:00'),
    (2, 4, 'image4.jpg', '2023-08-21 15:00:00'),
    (3, 5, 'image5.jpg', '2023-08-21 16:00:00'),
    (3, 6, 'image6.jpg', '2023-08-21 17:00:00'),
    (4, 7, 'image7.jpg', '2023-08-21 18:00:00'),
    (4, 8, 'image8.jpg', '2023-08-21 19:00:00'),
    (5, 9, 'image9.jpg', '2023-08-21 20:00:00'),
    (5, 10, 'image10.jpg', '2023-08-21 21:00:00');


-- spam_users テーブルのダミーデータ
INSERT INTO spam_users (user_id, spam_points, last_spam_activity)
VALUES
    (1, 5, '2023-08-21 12:00:00'),
    (2, 10, '2023-08-21 13:00:00'),
    (3, 3, '2023-08-21 14:00:00'),
    (4, 8, '2023-08-21 15:00:00'),
    (5, 2, '2023-08-21 16:00:00'),
    (6, 7, '2023-08-21 17:00:00'),
    (7, 4, '2023-08-21 18:00:00'),
    (8, 9, '2023-08-21 19:00:00'),
    (9, 6, '2023-08-21 20:00:00'),
    (10, 1, '2023-08-21 21:00:00');

-- banned_users テーブルのダミーデータ
INSERT INTO banned_users (user_id, ban_start_date, ban_end_date)
VALUES
    (1, '2023-08-21 12:00:00', '2023-08-22 12:00:00'),
    (2, '2023-08-21 13:00:00', '2023-08-23 13:00:00'),
    (3, '2023-08-21 14:00:00', '2023-08-24 14:00:00'),
    (4, '2023-08-21 15:00:00', '2023-08-25 15:00:00'),
    (5, '2023-08-21 16:00:00', '2023-08-26 16:00:00'),
    (6, '2023-08-21 17:00:00', '2023-08-27 17:00:00'),
    (7, '2023-08-21 18:00:00', '2023-08-28 18:00:00'),
    (8, '2023-08-21 19:00:00', '2023-08-29 19:00:00'),
    (9, '2023-08-21 20:00:00', '2023-08-30 20:00:00'),
    (10, '2023-08-21 21:00:00', '2023-08-31 21:00:00');


-- spam_messages テーブルのダミーデータ
INSERT INTO spam_messages (user_id, spam_type, message, timestamp)
VALUES
    (1, 1, 'これはスパムメッセージです。', '2023-08-21 12:00:00'),
    (2, 2, 'お得な情報があります。', '2023-08-21 13:00:00'),
    (3, 1, 'こちらをクリックしてください。', '2023-08-21 14:00:00'),
    (4, 3, '驚くべきニュースです！', '2023-08-21 15:00:00'),
    (5, 2, '無料プレゼントがあります。', '2023-08-21 16:00:00'),
    (6, 1, 'おめでとうございます！', '2023-08-21 17:00:00'),
    (7, 3, '限定オファーが届きました。', '2023-08-21 18:00:00'),
    (8, 2, 'このメッセージを開いてください。', '2023-08-21 19:00:00'),
    (9, 1, '素晴らしい機会です！', '2023-08-21 20:00:00'),
    (10, 3, 'プロダクトの詳細はこちら。', '2023-08-21 21:00:00');


INSERT INTO suspicious_messages (user_id,spam_type, message, timestamp)
VALUES
    (1, 1,'このメッセージは疑わしいです。', '2023-08-21 12:00:00'),
    (2, 2,'怪しい内容が含まれています。', '2023-08-21 13:00:00');